{
  "ford": {
    "summary": "Ford, established in 1903 by Henry Ford, revolutionized the automotive industry with the moving assembly line, making vehicles accessible to the masses. Known for innovation, Ford produces a diverse lineup of vehicles, including cars, trucks, and SUVs. Iconic models like the Ford Mustang and F-150 have become staples in the automotive world. Ford is also a leader in hybrid and electric vehicles, exemplified by the Ford Fusion Hybrid and Mustang Mach-E. Its vehicles are celebrated for durability, cutting-edge technology, and performance. Ford continues to lead with its EcoBoost engines and commitment to sustainability, offering customers reliability and modern design.",
    "history": "Founded in 1903, Ford is an American automotive giant that introduced groundbreaking innovations such as the moving assembly line, transforming vehicle manufacturing. The company's influence extends across generations of vehicles known for quality and performance.",
    "models": [
      "Ford F-150",
      "Ford Mustang",
      "Ford Explorer",
      "Ford Fusion",
      "Ford Escape",
      "Ford Bronco",
      "Ford Expedition",
      "Ford Focus",
      "Ford Ranger",
      "Ford Maverick",
      "Ford Transit",
      "Ford Edge",
      "Ford EcoSport",
      "Ford Taurus",
      "Ford Mustang Mach-E",
      "Ford Fiesta"
    ],
    "parts": [
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Alternator",
      "Timing Belt",
      "Transmission",
      "Radiator",
      "Shock Absorbers",
      "Air Filter",
      "Wiper Blades",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Control Arms",
      "Suspension Struts"
    ]
  },
  "toyota": {
    "summary": "Toyota, founded in 1937, is a global leader in automotive manufacturing, known for its reliability and innovation. Models like the Camry, Corolla, and RAV4 have become household names. Toyota is a pioneer in hybrid technology with the iconic Prius, setting the standard for eco-friendly vehicles. The brand emphasizes safety, durability, and advanced technology, incorporating features like Toyota Safety Sense in its models. With a strong focus on sustainability, Toyota continues to develop hydrogen fuel cell and electric vehicles, such as the Mirai and bZ4X. Its wide range of offerings ensures there’s a Toyota for every lifestyle and need.",
    "history": "Founded in 1937, Toyota is a Japanese automaker known for creating reliable and fuel-efficient vehicles. The company has led the way in hybrid technology with the Prius and continues to innovate with electric and hydrogen-powered cars.",
    "models": [
      "Toyota Camry",
      "Toyota Corolla",
      "Toyota RAV4",
      "Toyota Highlander",
      "Toyota Prius",
      "Toyota Tacoma",
      "Toyota Tundra",
      "Toyota 4Runner",
      "Toyota Avalon",
      "Toyota C-HR",
      "Toyota Sequoia",
      "Toyota Venza",
      "Toyota Mirai",
      "Toyota Sienna",
      "Toyota Supra",
      "Toyota bZ4X"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  },
  "chevrolet": {
    "summary": "Chevrolet, established in 1911, is an iconic American automotive brand renowned for its versatile lineup of cars, trucks, and SUVs. Known for vehicles like the Silverado, Corvette, and Malibu, Chevrolet combines performance, style, and durability. The brand has a rich history of innovation, offering electric vehicles like the Bolt EV and hybrid options. With a focus on safety and cutting-edge technology, Chevrolet equips many models with advanced driver-assistance systems. From muscle cars to rugged trucks, Chevrolet caters to diverse needs, maintaining a strong reputation as a dependable and forward-thinking automaker.",
    "history": "Founded in 1911, Chevrolet is an American brand under General Motors that has played a significant role in shaping the automotive industry. Its vehicles are synonymous with reliability and innovation, appealing to a wide range of consumers.",
    "models": [
      "Chevrolet Silverado",
      "Chevrolet Equinox",
      "Chevrolet Malibu",
      "Chevrolet Tahoe",
      "Chevrolet Suburban",
      "Chevrolet Traverse",
      "Chevrolet Blazer",
      "Chevrolet Camaro",
      "Chevrolet Corvette",
      "Chevrolet Bolt EV",
      "Chevrolet Colorado",
      "Chevrolet Impala",
      "Chevrolet Spark",
      "Chevrolet Trailblazer",
      "Chevrolet Cruze",
      "Chevrolet Avalanche"
    ],
    "parts": [
      "Alternator",
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Timing Belt",
      "Radiator",
      "Transmission",
      "Fuel Injector",
      "Wiper Blades",
      "Exhaust System",
      "Clutch Kit",
      "Shock Absorbers",
      "Air Filter",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Suspension Struts",
      "Control Arms"
    ]
  },
  "honda": {
    "summary": "Honda, founded in 1948, is a global leader in the automotive industry, known for producing reliable, fuel-efficient vehicles. Popular models like the Civic, Accord, and CR-V have become synonymous with Honda’s commitment to quality. Honda has a strong emphasis on innovation, offering vehicles equipped with advanced safety features, fuel-efficient engines, and cutting-edge technology. The brand also leads the way in hybrid vehicles with the Honda Insight and Clarity. Honda’s reputation for durability, low maintenance costs, and value for money makes it a preferred choice for many drivers.",
    "history": "Founded in 1948, Honda is a Japanese automaker known for its practical and well-engineered vehicles. It has become famous for its motorcycles and cars, while also being a leader in hybrid technology.",
    "models": [
      "Honda Civic",
      "Honda Accord",
      "Honda CR-V",
      "Honda Pilot",
      "Honda Odyssey",
      "Honda Fit",
      "Honda HR-V",
      "Honda Ridgeline",
      "Honda Insight",
      "Honda Clarity"
    ],
    "parts": [
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Alternator",
      "Timing Belt",
      "Transmission",
      "Radiator",
      "Shock Absorbers",
      "Air Filter",
      "Wiper Blades",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Control Arms",
      "Suspension Struts"
    ]
  },
  "nissan": {
    "summary": "Nissan, founded in 1933, is a Japanese automotive brand known for its innovative and reliable vehicles. The company offers a wide range of models, including the Altima, Maxima, and Rogue, which are popular for their comfort, performance, and affordability. Nissan has made strides in electric vehicle technology with models like the Nissan Leaf, one of the world’s best-selling electric cars. With a focus on safety, Nissan vehicles come equipped with the latest driver-assistance features, while its sporty lineup, like the 370Z and GT-R, continues to capture car enthusiasts’ attention.",
    "history": "Founded in 1933, Nissan is a leading Japanese automaker known for producing vehicles that blend innovation, safety, and affordability. The company has a strong presence in the electric vehicle market and offers a wide range of cars and trucks.",
    "models": [
      "Nissan Altima",
      "Nissan Maxima",
      "Nissan Rogue",
      "Nissan Sentra",
      "Nissan Murano",
      "Nissan Pathfinder",
      "Nissan Frontier",
      "Nissan Titan",
      "Nissan Leaf",
      "Nissan Juke"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  },
  "hyundai": {
    "summary": "Hyundai, founded in 1967, is a South Korean automotive manufacturer known for producing affordable, well-built vehicles. With models like the Elantra, Sonata, and Tucson, Hyundai is recognized for offering great value without compromising on quality or features. The brand has made significant strides in hybrid and electric vehicle technology with the Hyundai Ioniq and Kona Electric. Known for its long warranty and reliability, Hyundai continues to innovate with advanced safety features and cutting-edge infotainment systems in its vehicles.",
    "history": "Founded in 1967, Hyundai is a South Korean automaker renowned for its commitment to building high-quality vehicles that offer excellent value for money. The brand has also been a leader in the development of eco-friendly hybrid and electric vehicles.",
    "models": [
      "Hyundai Elantra",
      "Hyundai Sonata",
      "Hyundai Tucson",
      "Hyundai Santa Fe",
      "Hyundai Kona",
      "Hyundai Palisade",
      "Hyundai Ioniq",
      "Hyundai Accent",
      "Hyundai Nexo"
    ],
    "parts": [
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Alternator",
      "Timing Belt",
      "Transmission",
      "Radiator",
      "Shock Absorbers",
      "Air Filter",
      "Wiper Blades",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Control Arms",
      "Suspension Struts"
    ]
  },
  "kia": {
    "summary": "Kia, founded in 1944, is a South Korean automaker that has rapidly gained recognition for its stylish, well-equipped vehicles. With a lineup that includes popular models like the Kia Sorento, Sportage, and Forte, Kia offers affordable options with modern features. The brand has embraced electric vehicles with models like the Kia EV6 and Niro EV, making a mark in the eco-friendly market. Kia’s vehicles are known for their high-tech interiors, strong safety features, and industry-leading warranties.",
    "history": "Founded in 1944, Kia is South Korea's second-largest automaker, known for producing affordable, stylish vehicles that offer great value. The brand is making strides in electric vehicles and continues to innovate.",
    "models": [
      "Kia Sorento",
      "Kia Sportage",
      "Kia Forte",
      "Kia Optima",
      "Kia Seltos",
      "Kia Telluride",
      "Kia Stinger",
      "Kia Soul",
      "Kia Niro",
      "Kia EV6"
    ],
    "parts": [
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Alternator",
      "Timing Belt",
      "Transmission",
      "Radiator",
      "Shock Absorbers",
      "Air Filter",
      "Wiper Blades",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Control Arms",
      "Suspension Struts"
    ]
  },
  "jeep": {
    "summary": "Jeep, founded in 1941, is an American brand best known for its rugged, off-road vehicles. With iconic models like the Jeep Wrangler and Grand Cherokee, Jeep has built a loyal following among adventure enthusiasts. The brand has become synonymous with off-road capability, with a focus on durability, versatility, and performance. Jeep has also expanded its lineup to include more urban-friendly models like the Jeep Compass and Cherokee, while continuing to innovate with plug-in hybrid and electric vehicles, such as the Jeep Grand Cherokee 4xe and Jeep Wrangler 4xe.",
    "history": "Founded in 1941, Jeep is an iconic American brand known for its military origins and legendary off-road vehicles. The brand continues to be a leader in the SUV and off-road vehicle market.",
    "models": [
      "Jeep Wrangler",
      "Jeep Grand Cherokee",
      "Jeep Compass",
      "Jeep Cherokee",
      "Jeep Gladiator",
      "Jeep Renegade",
      "Jeep Wagoneer",
      "Jeep Grand Wagoneer"
    ],
    "parts": [
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Alternator",
      "Timing Belt",
      "Transmission",
      "Radiator",
      "Shock Absorbers",
      "Air Filter",
      "Wiper Blades",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Control Arms",
      "Suspension Struts"
    ]
  },
  "subaru": {
    "summary": "Subaru, founded in 1953, is known for its all-wheel-drive vehicles, rugged reliability, and emphasis on safety. Its lineup of cars, SUVs, and crossovers offers a balance of utility and performance. Iconic models like the Subaru Outback, Impreza, and Forester are popular among adventure seekers and those looking for a practical, durable vehicle. Subaru has also led the charge in promoting eco-friendly vehicles with hybrid models like the Subaru Crosstrek Hybrid. The brand is committed to sustainability, producing vehicles with advanced safety features and long-lasting performance.",
    "history": "Founded in 1953, Subaru is a Japanese automaker known for creating practical and reliable vehicles with all-wheel drive as a key feature. Its vehicles are renowned for their safety and performance, especially in challenging conditions.",
    "models": [
      "Subaru Outback",
      "Subaru Impreza",
      "Subaru Forester",
      "Subaru Crosstrek",
      "Subaru Legacy",
      "Subaru WRX",
      "Subaru Ascent",
      "Subaru BRZ",
      "Subaru XV",
      "Subaru Tribeca"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  },
  "dodge": {
    "summary": "Dodge, established in 1900, is an American brand renowned for its performance-driven vehicles. The brand's lineup includes muscle cars like the Dodge Challenger and Charger, as well as the versatile Dodge Durango and Ram trucks. Dodge vehicles are known for their bold styling, powerful engines, and aggressive performance. The brand also emphasizes safety with advanced features like blind-spot monitoring and adaptive cruise control. Dodge continues to innovate with high-performance variants and expanding its lineup of SUVs and trucks.",
    "history": "Founded in 1900, Dodge is an American automaker with a history of producing high-performance muscle cars, trucks, and SUVs. It is known for combining power with style, offering vehicles that appeal to enthusiasts and practical consumers alike.",
    "models": [
      "Dodge Charger",
      "Dodge Challenger",
      "Dodge Durango",
      "Dodge Journey",
      "Dodge Grand Caravan",
      "Dodge Ram 1500",
      "Dodge Ram 2500",
      "Dodge Ram 3500"
    ],
    "parts": [
      "Alternator",
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Timing Belt",
      "Radiator",
      "Transmission",
      "Fuel Injector",
      "Exhaust System",
      "Wiper Blades",
      "Clutch Kit",
      "Shock Absorbers",
      "Air Filter",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Suspension Struts",
      "Control Arms"
    ]
  },
  "gmc": {
    "summary": "GMC, founded in 1901, is a division of General Motors that specializes in rugged trucks, SUVs, and commercial vehicles. Known for models like the GMC Sierra, Yukon, and Terrain, GMC offers premium vehicles with advanced technology, performance, and luxury features. The brand caters to customers seeking both workhorse vehicles and upscale offerings, often combining powerful engines with refined interiors. GMC is also known for its dedication to safety, efficiency, and innovation, making it a reliable choice for those in need of strength and style.",
    "history": "Founded in 1901, GMC is an American brand under General Motors, specializing in trucks and SUVs. It is known for producing durable, high-performance vehicles for both commercial and personal use.",
    "models": [
      "GMC Sierra",
      "GMC Yukon",
      "GMC Terrain",
      "GMC Acadia",
      "GMC Canyon",
      "GMC Savana",
      "GMC Sierra HD"
    ],
    "parts": [
      "Alternator",
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Timing Belt",
      "Radiator",
      "Transmission",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Shock Absorbers",
      "Wiper Blades",
      "Air Filter",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Suspension Struts",
      "Control Arms"
    ]
  },
  "volkswagen": {
    "summary": "Volkswagen, founded in 1937, is a German automaker known for producing a wide range of vehicles, from compact cars to SUVs. Iconic models like the Volkswagen Golf, Passat, and Beetle have become symbols of quality, innovation, and style. Volkswagen is a leader in efficiency and sustainability, with vehicles like the ID.4 and ID. Buzz spearheading the brand's electric future. Known for its performance-oriented R-line models and advanced safety features, Volkswagen continues to offer both practicality and driving excitement.",
    "history": "Founded in 1937, Volkswagen is a German automaker that has produced some of the most iconic cars in history, like the Beetle and Golf. Known for its innovation and commitment to quality, Volkswagen is a leader in both traditional and electric vehicle manufacturing.",
    "models": [
      "Volkswagen Golf",
      "Volkswagen Passat",
      "Volkswagen Jetta",
      "Volkswagen Tiguan",
      "Volkswagen Atlas",
      "Volkswagen ID.4",
      "Volkswagen Beetle",
      "Volkswagen Arteon",
      "Volkswagen ID. Buzz"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  },
  "mazda": {
    "summary": "Mazda, founded in 1920, is a Japanese automaker known for its stylish, fun-to-drive vehicles with a focus on handling and efficiency. Models like the Mazda 3, Mazda CX-5, and Mazda MX-5 Miata offer dynamic driving experiences combined with sleek designs. Mazda is also known for its Skyactiv technology, which enhances performance and fuel efficiency. With a commitment to innovation, Mazda continues to push boundaries with vehicles like the electric Mazda MX-30, offering eco-friendly options without compromising on the driving experience.",
    "history": "Founded in 1920, Mazda is a Japanese automaker known for creating vehicles that emphasize performance and handling. Its cars are widely praised for their dynamic driving experience, stylish design, and fuel efficiency.",
    "models": [
      "Mazda 3",
      "Mazda CX-5",
      "Mazda CX-9",
      "Mazda MX-5 Miata",
      "Mazda CX-30",
      "Mazda 6",
      "Mazda MX-30"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  },
  "ram": {
    "summary": "Ram, a division of Fiat Chrysler Automobiles (FCA), specializes in rugged trucks and commercial vehicles. Known for its durable Ram 1500, 2500, and 3500 series, the brand delivers power and capability for both work and personal use. Ram trucks are equipped with advanced technology, comfortable interiors, and powerful engine options, making them a favorite among truck enthusiasts. The brand has also ventured into the electric market with the Ram 1500 REV, marking its commitment to innovation and sustainability.",
    "history": "Ram is an American brand under FCA (now part of Stellantis) that focuses on trucks and commercial vehicles. Its vehicles are known for their power, reliability, and ability to handle tough jobs while offering comfort and advanced features.",
    "models": [
      "Ram 1500",
      "Ram 2500",
      "Ram 3500",
      "Ram ProMaster",
      "Ram ProMaster City"
    ],
    "parts": [
      "Alternator",
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Timing Belt",
      "Radiator",
      "Transmission",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Shock Absorbers",
      "Wiper Blades",
      "Air Filter",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Suspension Struts",
      "Control Arms"
    ]
  },
  "buick": {
    "summary": "Buick, founded in 1899, is an American brand known for its premium vehicles that combine comfort, advanced technology, and sophisticated design. Buick's lineup includes the Enclave, Encore, and LaCrosse, offering luxury features at a more affordable price point. The brand has evolved with the times, introducing hybrid options like the Buick LaCrosse Hybrid and focusing on technology such as advanced driver-assistance systems. Buick vehicles are ideal for those seeking an elevated driving experience with a blend of luxury and practicality.",
    "history": "Founded in 1899, Buick is an American brand that has long been synonymous with luxury, offering vehicles that prioritize comfort, technology, and craftsmanship.",
    "models": [
      "Buick Enclave",
      "Buick Encore",
      "Buick LaCrosse",
      "Buick Regal",
      "Buick Cascada"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  },
  "chrysler": {
    "summary": "Chrysler, founded in 1925, is an American brand known for its full-size sedans, minivans, and innovative technologies. Models like the Chrysler Pacifica and Chrysler 300 offer a mix of luxury, space, and practicality. The brand is recognized for its stylish designs, comfort-oriented features, and technology, including the introduction of hybrid options like the Chrysler Pacifica Hybrid. Chrysler vehicles combine sophisticated interiors with advanced safety features, catering to families and those seeking a blend of performance and luxury.",
    "history": "Founded in 1925, Chrysler is an American automaker that has produced a variety of vehicles, from luxury sedans to family-friendly minivans, known for their comfort, style, and innovative technology.",
    "models": [
      "Chrysler Pacifica",
      "Chrysler 300",
      "Chrysler Voyager"
    ],
    "parts": [
      "Alternator",
      "Brake Pads",
      "Battery",
      "Oil Filter",
      "Spark Plugs",
      "Timing Belt",
      "Radiator",
      "Transmission",
      "Fuel Injector",
      "Exhaust System",
      "Clutch Kit",
      "Shock Absorbers",
      "Wiper Blades",
      "Air Filter",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wheel Bearings",
      "Suspension Struts",
      "Control Arms"
    ]
  },
  "mitsubishi": {
    "summary": "Mitsubishi, founded in 1970, is a Japanese automaker known for producing a range of vehicles that blend practicality, innovation, and performance. Models like the Mitsubishi Outlander and Eclipse Cross are popular for their versatility and affordability. The brand also emphasizes eco-friendly driving with electric models like the Mitsubishi Outlander PHEV. Mitsubishi offers a solid warranty and durable vehicles that provide a reliable driving experience, making it a great option for those seeking value and functionality.",
    "history": "Founded in 1970, Mitsubishi is a Japanese automaker that has produced a diverse range of vehicles, focusing on practicality, performance, and environmental sustainability with models like the Outlander PHEV.",
    "models": [
      "Mitsubishi Outlander",
      "Mitsubishi Eclipse Cross",
      "Mitsubishi Mirage",
      "Mitsubishi ASX",
      "Mitsubishi Lancer"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  },
  "fiat": {
    "summary": "Fiat, founded in 1899, is an Italian automaker known for producing compact cars, stylish city vehicles, and innovative designs. Models like the Fiat 500 and Fiat Panda have gained popularity for their small size, fuel efficiency, and urban-centric features. Fiat vehicles are perfect for navigating tight city spaces while still offering modern technology and a fun driving experience. The brand also offers eco-friendly options, such as the Fiat 500 Electric, focusing on sustainability while maintaining its signature charm and style.",
    "history": "Founded in 1899, Fiat is an Italian automaker known for producing compact cars that blend style, efficiency, and practicality. Its vehicles are ideal for city driving and eco-conscious consumers.",
    "models": [
      "Fiat 500",
      "Fiat Panda",
      "Fiat Tipo",
      "Fiat 500X",
      "Fiat 124 Spider"
    ],
    "parts": [
      "Oil Filter",
      "Brake Pads",
      "Battery",
      "Spark Plugs",
      "Timing Belt",
      "Alternator",
      "Radiator",
      "Fuel Injector",
      "Transmission",
      "Shock Absorbers",
      "Clutch Kit",
      "Exhaust System",
      "Power Steering Pump",
      "Headlights",
      "Tail Lights",
      "Wiper Blades",
      "Wheel Bearings",
      "Air Filter",
      "Suspension Components",
      "Control Arms"
    ]
  }
}